In [4]:
import pandas as pd

## Creating DataFrame

In [8]:
# From Dictionary
data = {'name': ['Alice', 'Bob', 'Charlie'], 'age': [25,30,35]}
df = pd.DataFrame(data)

In [9]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [10]:
df.columns

Index(['name', 'age'], dtype='object')

In [15]:
# From list of lists
data = [['Alice',25], ['Bob',30],['Charlie',35]]
df = pd.DataFrame(data)

In [16]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [17]:
 df.columns

RangeIndex(start=0, stop=2, step=1)

In [19]:
df = pd.DataFrame(data, columns = ['name','age'])

In [20]:
df.columns

Index(['name', 'age'], dtype='object')

### Accessing Data

In [21]:
df['name']

0      Alice
1        Bob
2    Charlie
Name: name, dtype: object

In [22]:
type(df['name'])

pandas.core.series.Series

In [24]:
list_col = ['name', 'age']
df[list_col] #which is similar to df[['name', 'age']]

      name  age
0    Alice   25
1      Bob   30
2  Charlie   35

### Condition based Filtering

In [26]:
df['age']>=30

0    False
1     True
2     True
Name: age, dtype: bool

In [28]:
df[df['age'] >= 30 ]

      name  age
1      Bob   30
2  Charlie   35

In [31]:
df[df['name'].str.startswith('A') & (df['age'] >= 25)]

    name  age
0  Alice   25

In [32]:
df['age'].isna()

0    False
1    False
2    False
Name: age, dtype: bool

In [33]:
df[df['age'].isna()]

Empty DataFrame
Columns: [name, age]
Index: []

### Filtering using existing methods

In [34]:
df.loc[0,'name'] #location dine, row ra column ko

'Alice'

In [37]:
df.loc[0:1]

    name  age
0  Alice   25
1    Bob   30

In [42]:
df.loc[0:1,['name','age']] #direct mapping gareko vayara 0:1 garda 1 samma kai diyo

    name  age
0  Alice   25
1    Bob   30

In [43]:
df.iloc[0,0] # column ko pani name nadiyara index nai pass garne

'Alice'

In [44]:
df.iloc[0:2,[0,1]] #yasma indexing vaako vayara 0:2 garda 1 samma aayo

    name  age
0  Alice   25
1    Bob   30

In [46]:
df.at[0,'name'] #single cell grab garna ko laagi

'Alice'

## Reading and writing data

In [50]:
df = pd.read_csv('./../practice_pandas_1data.csv')

In [51]:
df

    name  age
0  Alice   25
1    Bob   30

In [52]:
df.loc[2,'name'] = 'Charle'
df.loc[2,'age'] = 35

In [53]:
print(df)

     name   age
0   Alice  25.0
1     Bob  30.0
2  Charle  35.0

In [54]:
df.to_csv('./../practice_pandas_1data.csv', index = False)

In [55]:
df.tail(2)

     name   age
1     Bob  30.0
2  Charle  35.0

In [56]:
df.head(1)

    name   age
0  Alice  25.0

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      float64
dtypes: float64(1), object(1)
memory usage: 176.0+ bytes

In [58]:
df.describe()

        age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [59]:
df.value_counts()

name    age
Alice   25.0    1
Bob     30.0    1
Charle  35.0    1
Name: count, dtype: int64

In [60]:
df.shape

(3, 2)

In [61]:
df.isnull()

    name    age
0  False  False
1  False  False
2  False  False

In [62]:
df.isnull().sum() # boolean maa sum lagauna paiyo

name    0
age     0
dtype: int64